src/InformationRegisters/СтатистикаБуферДата/СтатистикаБуферДата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаБуферДата</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатистикаБуферДата/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ДобавитьДанные(ДатаЗаписи, Данные) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СтатистикаБуферДата.СоздатьМенеджерЗаписи();
    МенеджерЗаписи.ДатаЗаписи = ДатаЗаписи;
	МенеджерЗаписи.ГУИД = Новый УникальныйИдентификатор();
	МенеджерЗаписи.Данные = Данные;
	
	МенеджерЗаписи.Записать(Ложь);
	
КонецПроцедуры    
    
Функция ПолучитьТекущиеНомераПакетов() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1000
	|	СтатистикаБуферДата.ПорядковыйНомерПакета КАК ПорядковыйНомерПакета
	|ИЗ
	|	РегистрСведений.СтатистикаБуферДата КАК СтатистикаБуферДата
	|УПОРЯДОЧИТЬ ПО
    |   ПорядковыйНомерПакета
	|";
	
	Результат = Запрос.Выполнить();
	
	НомераПакетов = Новый Массив;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НомераПакетов.Добавить(Выборка.ПорядковыйНомерПакета);
	КонецЦикла;
	
	Возврат НомераПакетов;
КонецФункции

Процедура УдалитьДанныеПакета(РезультатЗапроса) Экспорт
    
    Выборка = РезультатЗапроса.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        
        МенеджерЗаписи = СоздатьМенеджерЗаписи();
        МенеджерЗаписи.ДатаЗаписи = Выборка.Период;
        МенеджерЗаписи.ГУИД = Выборка.ГУИД;
        МенеджерЗаписи.Удалить();
                
    КонецЦикла;
    
КонецПроцедуры

#КонецЕсли
